c1570/rp2040js/cts2c/helper-checks.c
// Standalone correctness checks for C function helpers cts2c.js emits in
// place of transpiled TS (see its FunctionDeclaration name-override blocks):
//
//  - floatToBits/bitsToFloat/isSignNegative/readDouble/writeDouble's bit-punning
//    bodies, exercised with non-trivial (non-integer-valued) float/double values —
//    deliberately NOT covered by any of the reference demos' CRC32 parity tests,
//    which is exactly how the pre-fix bug (wrong C parameter/return types causing
//    numeric, not bit-for-bit, conversion) went undetected.
//  - checkTraceMagic/checkTraceMagicM33/checkTraceMagicM0's allocation-free trace
//    hook bodies: write the 0xabcd/0xffff marker + tag into (virtual) chip memory,
//    call the hook, and verify the chip's onTrace callback fires exactly once with
//    the right core number, PC and tag string.
//  - the transpiled cores' add/sub/mul/div opcodes, run as hand-assembled
//    instructions on each core (RISC-V, Cortex-M33, Cortex-M0+) with boundary
//    operands — the cases where a uint-vs-int mixup in the generated C silently
//    changes the result (see the section comment near the end for details).
//
// Exits non-zero and prints a diagnostic on the first mismatch.
#include "../build/transpile/rp2350js-c.h"
#include <stdio.h>
#include <string.h>

static int failures = 0;

static void checkU32(const char* label, uint32_t got, uint32_t want) {
  if (got != want) {
    fprintf(stderr, "FAIL %s: got 0x%08x, want 0x%08x\n", label, got, want);
    failures++;
  } else {
    printf("ok   %s: 0x%08x\n", label, got);
  }
}

static void checkF32(const char* label, float got, float want) {
  uint32_t gotBits, wantBits;
  memcpy(&gotBits, &got, sizeof(gotBits));
  memcpy(&wantBits, &want, sizeof(wantBits));
  if (gotBits != wantBits) {
    fprintf(stderr, "FAIL %s: got %.9g (0x%08x), want %.9g (0x%08x)\n", label, got, gotBits, want, wantBits);
    failures++;
  } else {
    printf("ok   %s: %.9g\n", label, got);
  }
}

static void checkF64(const char* label, double got, double want) {
  uint64_t gotBits, wantBits;
  memcpy(&gotBits, &got, sizeof(gotBits));
  memcpy(&wantBits, &want, sizeof(wantBits));
  if (gotBits != wantBits) {
    fprintf(stderr, "FAIL %s: got %.17g (0x%016llx), want %.17g (0x%016llx)\n", label, got, (unsigned long long)gotBits, want, (unsigned long long)wantBits);
    failures++;
  } else {
    printf("ok   %s: %.17g\n", label, got);
  }
}

static void checkBool(const char* label, bool got, bool want) {
  if (got != want) {
    fprintf(stderr, "FAIL %s: got %d, want %d\n", label, got, want);
    failures++;
  } else {
    printf("ok   %s: %d\n", label, got);
  }
}

static void checkI32(const char* label, int32_t got, int32_t want) {
  if (got != want) {
    fprintf(stderr, "FAIL %s: got %d, want %d\n", label, got, want);
    failures++;
  } else {
    printf("ok   %s: %d\n", label, got);
  }
}

static void checkStr(const char* label, const char* got, const char* want) {
  if (strcmp(got, want) != 0) {
    fprintf(stderr, "FAIL %s: got \"%s\", want \"%s\"\n", label, got, want);
    failures++;
  } else {
    printf("ok   %s: \"%s\"\n", label, got);
  }
}

// ─── add/sub/mul/div opcode checks (uint-vs-int traps) ───────────────────

// R-type with rs1=x1, rs2=x2, rd=x5.
static uint32_t rv_r(uint32_t funct3, uint32_t funct7) {
  return 0x33u | (5u << 7) | (funct3 << 12) | (1u << 15) | (2u << 20) | (funct7 << 25);
}

static uint32_t rv_alu(RP2350* mcu, CPU* cpu, uint32_t insn, uint32_t a, uint32_t b) {
  const uint32_t base = 0x20040000;
  cpu->regs[1] = (int32_t)a;
  cpu->regs[2] = (int32_t)b;
  cpu->regs[5] = 0;
  RP2350_writeUint32(mcu, base, insn);
  cpu->pc = (int32_t)base;
  cpu->next_pc = (int32_t)(base + 4);
  CPU_executeInstruction(cpu);
  return (uint32_t)cpu->regs[5];
}

// Executes a Thumb instruction (w1, plus w2 for 32-bit encodings; pass 0 for
// 16-bit ones) with r1=a, r2=b, r5 preloaded with b (MULS needs rd==rm) and
// returns r5; *hiOut (optional) receives r6 for SMULL/UMULL results.
static uint32_t m33_exec(
    RP2350* mcu, CortexM33Core* core, uint16_t w1, uint16_t w2, uint32_t a, uint32_t b, uint32_t* hiOut) {
  const uint32_t base = 0x20040000;
  core->regs->r[1] = a;
  core->regs->r[2] = b;
  core->regs->r[5] = b;
  core->regs->r[6] = 0;
  RP2350_writeUint16(mcu, base, w1);
  if (w2) RP2350_writeUint16(mcu, base + 2, w2);
  core->regs->r[15] = base;
  CortexM33Core_executeInstruction(core);
  if (hiOut) *hiOut = core->regs->r[6];
  return core->regs->r[5];
}

static uint32_t m0_exec(RP2040* mcu, CortexM0Core* core, uint16_t insn, uint32_t a, uint32_t b) {
  const uint32_t base = 0x20040000;
  core->registers[1] = a;
  core->registers[2] = b;
  core->registers[5] = b;
  RP2040_writeUint16(mcu, base, insn);
  core->registers[15] = base;
  CortexM0Core_executeInstruction(core);
  return core->registers[5];
}

// ─── checkTraceMagic* callback tests ─────────────────────────────────────

static int trace_calls = 0;
static int32_t trace_core;
static int32_t trace_pc;
static char trace_tag[128];
static void* trace_ctx_seen;

static void on_trace(void* ctx, int32_t coreNumber, int32_t pc, const char* tag) {
  (void)ctx;
  trace_calls++;
  trace_ctx_seen = ctx;
  trace_core = coreNumber;
  trace_pc = pc;
  snprintf(trace_tag, sizeof trace_tag, "%s", tag);
}

static void trace_reset(void) {
  trace_calls = 0;
  trace_ctx_seen = NULL;
  trace_core = -1;
  trace_pc = -1;
  trace_tag[0] = '\0';
}

static void rp2350_write_tag(RP2350* mcu, uint32_t addr, const char* tag) {
  size_t n = strlen(tag);
  for (size_t i = 0; i < n; i++) RP2350_writeUint8(mcu, addr + (uint32_t)i, (uint32_t)(uint8_t)tag[i]);
  RP2350_writeUint8(mcu, addr + (uint32_t)n, 0); // NUL terminator
}

static void rp2040_write_tag(RP2040* mcu, uint32_t addr, const char* tag) {
  size_t n = strlen(tag);
  for (size_t i = 0; i < n; i++) RP2040_writeUint8(mcu, addr + (uint32_t)i, (uint32_t)(uint8_t)tag[i]);
  RP2040_writeUint8(mcu, addr + (uint32_t)n, 0); // NUL terminator
}

