c1570/rp2040js/cts2c/helper-checks.c
// ─── Timer alarm scheduling (uint-vs-int overflow) ───────────────────────
// A 2.5 s alarm has a 2.5e9 ns delta — past INT32_MAX. The generated C used to
// compute it as int32*int32 (`1000.0` transpiled as `1000`), overflowing so the
// alarm fired immediately; a `double deltaMicros` local plus the preserved
// float literal fixes it. This test fails if either regresses.
static void check_timer_alarm_overflow(void) {
  RP2350Options options = {.coreArch = "arm", .loadFirmware = NULL};
  RP2350* mcu = RP2350_new(&options);
  const uint32_t timer = 0x400b0000u; // TIMER0 base; ALARM0 at +0x10, INTR at +0x3c
  RP2350_writeUint32(mcu, timer + 0x10, 2500000); // target 2.5e6 µs ahead of the zeroed clock
  SimulationClock_tick(mcu->clock, 2.4e9);
  checkU32("timer >2.1s alarm not fired early", RP2350_readUint32(mcu, timer + 0x3c) & 1u, 0);
  SimulationClock_tick(mcu->clock, 0.2e9);
  checkU32("timer >2.1s alarm fired", RP2350_readUint32(mcu, timer + 0x3c) & 1u, 1);
}

int main(void) {
  // floatToBits/bitsToFloat: 3.14159f's real IEEE-754 bits are 0x40490FD0 — NOT the
  // bit pattern for 3.0f (0x40400000), which is what the pre-fix
  // truncate-to-int32-then-reconvert bug would have silently produced instead.
  float pi_f = 3.14159f;
  uint32_t pi_bits = 0x40490FD0u;
  checkU32("floatToBits(3.14159f)", (uint32_t)floatToBits(pi_f), pi_bits);
  checkF32("bitsToFloat(0x40490FD0)", bitsToFloat((int32_t)pi_bits), pi_f);

  // Negative fractional value.
  float neg_f = -2.5f;
  uint32_t neg_bits = 0xC0200000u;
  checkU32("floatToBits(-2.5f)", (uint32_t)floatToBits(neg_f), neg_bits);
  checkF32("bitsToFloat(0xC0200000)", bitsToFloat((int32_t)neg_bits), neg_f);

  // isSignNegative: real double bit-sign check, not a truncated-then-reconverted value.
  checkBool("isSignNegative(3.14159)", isSignNegative(3.14159), false);
  checkBool("isSignNegative(-3.14159)", isSignNegative(-3.14159), true);
  checkBool("isSignNegative(-0.0)", isSignNegative(-0.0), true);
  checkBool("isSignNegative(0.0)", isSignNegative(0.0), false);

  // readDouble/writeDouble: round-trip a genuinely fractional double through the
  // "halves" storage DCP registers actually use.
  M33CoreState st;
  uint32_t halves[16] = {0};
  st.dcpHalves = halves;
  double pi = 3.14159265358979;
  writeDouble(&st, 2, pi);
  checkF64("readDouble(writeDouble(pi))", readDouble(&st, 2), pi);

  double negVal = -123456.789;
  writeDouble(&st, 5, negVal);
  checkF64("readDouble(writeDouble(-123456.789))", readDouble(&st, 5), negVal);

  // f64ToI32Sat/f64ToU32Sat (DCP d2i/d2u): a plain `number` param truncates to
  // int32_t at the call boundary, discarding the fractional part BEFORE the
  // function's own truncate-toward-zero logic ever runs — 42.9 truncated to 42
  // (int32_t) first, then to 42 again, silently matching by coincidence; the real
  // bug shows on a value whose int32-truncated bit pattern differs from its
  // correct double-truncated one, e.g. anything requiring the saturation checks
  // to see the ORIGINAL fractional value, or simply a large fractional value.
  checkI32("f64ToI32Sat(42.9)", f64ToI32Sat(42.9), 42);
  checkI32("f64ToI32Sat(-42.9)", f64ToI32Sat(-42.9), -42);
  checkI32("f64ToI32Sat(3000000000.5)", f64ToI32Sat(3000000000.5), 0x7fffffff);
  checkU32("f64ToU32Sat(42.9)", (uint32_t)f64ToU32Sat(42.9), 42u);
  checkU32("f64ToU32Sat(5000000000.5)", (uint32_t)f64ToU32Sat(5000000000.5), 0xffffffffu);

  // ─── checkTraceMagic (RISC-V) ──────────────────────────────────────────
  // The `j` over the marker is 4 bytes, so the marker sits at the link address
  // itself (0xabcd at +0, 0xffff at +2) and the tag at +4. The hook reports the
  // cpu's CURRENT pc/mhartid — not the marker address.
  {
    RP2350Options options = {.coreArch = "riscv", .loadFirmware = NULL};
    RP2350* mcu = RP2350_new(&options);
    mcu->onTrace_fn = on_trace;
    mcu->onTrace_ctx = (void*)0x1234;
    CPU* cpu = RP2350_riscvCore1_get(mcu); // core 1 proves the number is forwarded
    const uint32_t base = 0x20000000;
    RP2350_writeUint16(mcu, base, 0xabcd);
    RP2350_writeUint16(mcu, base + 2, 0xffff);
    rp2350_write_tag(mcu, base + 4, "riscv trace");
    cpu->pc = 0x20000123; // distinctive: the callback must see THIS, not `base`

    trace_reset();
    checkTraceMagic(cpu, base);
    checkI32("trace riscv fired once", trace_calls, 1);
    checkI32("trace riscv core number", trace_core, 1);
    checkI32("trace riscv pc", trace_pc, 0x20000123);
    checkStr("trace riscv tag", trace_tag, "riscv trace");
    checkBool("trace riscv ctx passthrough", trace_ctx_seen == (void*)0x1234, true);

    // Half a marker (0xffff missing) must stay silent.
    trace_reset();
    RP2350_writeUint16(mcu, base + 2, 0x0000);
    checkTraceMagic(cpu, base);
    checkI32("trace riscv no fire on bad marker", trace_calls, 0);
  }

  // ─── checkTraceMagicM33 (Cortex-M33) ───────────────────────────────────
  // Thumb `b` is 2 bytes, so the marker sits at opcodePC+2/+4 and the tag at
  // +6. The hook reports (coreIndex, opcodePC).
  {
    RP2350Options options = {.coreArch = "arm", .loadFirmware = NULL};
    RP2350* mcu = RP2350_new(&options);
    mcu->onTrace_fn = on_trace;
    CortexM33Core* core = RP2350_armCore1_get(mcu);
    const uint32_t base = 0x20000100;
    RP2350_writeUint16(mcu, base + 2, 0xabcd);
    RP2350_writeUint16(mcu, base + 4, 0xffff);
    rp2350_write_tag(mcu, base + 6, "m33 trace");

    trace_reset();
    checkTraceMagicM33(core, base);
    checkI32("trace m33 fired once", trace_calls, 1);
    checkI32("trace m33 core number", trace_core, 1);
    checkI32("trace m33 pc", trace_pc, (int32_t)base);
    checkStr("trace m33 tag", trace_tag, "m33 trace");

    // Empty tag (NUL right after the marker) fires with "".
    trace_reset();
    RP2350_writeUint8(mcu, base + 6, 0);
    checkTraceMagicM33(core, base);
    checkI32("trace m33 empty tag fired", trace_calls, 1);
    checkStr("trace m33 empty tag", trace_tag, "");

    // A 70-char tag is capped at 63 chars by the 64-byte stack buffer (the C
    // body's documented divergence from the unbounded TS string building).
    trace_reset();
    char longTag[71];
    memset(longTag, 'A', sizeof longTag - 1);
    longTag[sizeof longTag - 1] = '\0';
    rp2350_write_tag(mcu, base + 6, longTag);
    char wantTag[64];
    memset(wantTag, 'A', sizeof wantTag - 1);
    wantTag[sizeof wantTag - 1] = '\0';
    checkTraceMagicM33(core, base);
    checkStr("trace m33 long tag truncated to 63", trace_tag, wantTag);

    // No marker at all must stay silent.
    trace_reset();
    RP2350_writeUint16(mcu, base + 2, 0x1234);
    checkTraceMagicM33(core, base);
    checkI32("trace m33 no fire on bad marker", trace_calls, 0);
  }

