c1570/rp2040js/cts2c/helper-checks.c
  // ─── checkTraceMagicM0 (Cortex-M0+, RP2040) ────────────────────────────
  // Same +2/+4/+6 marker layout as M33, but reads go through the M0 core's
  // own helpers and the hook reports (coreNumber, current PC).
  {
    RP2040Options options = {.loadFirmware = NULL};
    RP2040* mcu = RP2040_new(&options);
    mcu->onTrace_fn = on_trace;
    CortexM0Core* core = RP2040_core0_get(mcu);
    const uint32_t base = 0x20000000;
    RP2040_writeUint16(mcu, base + 2, 0xabcd);
    RP2040_writeUint16(mcu, base + 4, 0xffff);
    rp2040_write_tag(mcu, base + 6, "m0 trace");
    int32_t pcBefore = CortexM0Core_PC_get(core);

    trace_reset();
    checkTraceMagicM0(core, base);
    checkI32("trace m0 fired once", trace_calls, 1);
    checkI32("trace m0 core number", trace_core, 0);
    checkI32("trace m0 pc", trace_pc, pcBefore);
    checkStr("trace m0 tag", trace_tag, "m0 trace");

    // No marker must stay silent.
    trace_reset();
    RP2040_writeUint16(mcu, base + 2, 0x0000);
    checkTraceMagicM0(core, base);
    checkI32("trace m0 no fire on bad marker", trace_calls, 0);
  }

  // ─── RISC-V add/sub/mul/div (RV32IM opcodes) ───────────────────────────
  {
    RP2350Options options = {.coreArch = "riscv", .loadFirmware = NULL};
    RP2350* mcu = RP2350_new(&options);
    CPU* cpu = RP2350_riscvCore0_get(mcu);

    // ADD: wrap at the signed/unsigned top.
    checkU32("rv add 0x7fffffff+1", rv_alu(mcu, cpu, rv_r(0, 0x00), 0x7fffffff, 1), 0x80000000u);
    checkU32("rv add 0xffffffff+0xffffffff", rv_alu(mcu, cpu, rv_r(0, 0x00), 0xffffffff, 0xffffffff), 0xfffffffeu);
    // SUB: borrow across zero and out of INT_MIN.
    checkU32("rv sub 0-1", rv_alu(mcu, cpu, rv_r(0, 0x20), 0, 1), 0xffffffffu);
    checkU32("rv sub 0x80000000-1", rv_alu(mcu, cpu, rv_r(0, 0x20), 0x80000000, 1), 0x7fffffffu);
    // MUL: low 32 bits only.
    checkU32("rv mul 0x10001*0x10001", rv_alu(mcu, cpu, rv_r(0, 0x01), 0x00010001, 0x00010001), 0x00020001u);
    checkU32("rv mul -1*-1", rv_alu(mcu, cpu, rv_r(0, 0x01), 0xffffffff, 0xffffffff), 1);
    checkU32("rv mul 0x80000000*2", rv_alu(mcu, cpu, rv_r(0, 0x01), 0x80000000, 2), 0);
    // MULH/MULHU/MULHSU: THE signed-vs-unsigned discriminator.
    checkU32("rv mulh INT_MIN*INT_MIN", rv_alu(mcu, cpu, rv_r(1, 0x01), 0x80000000, 0x80000000), 0x40000000u);
    checkU32("rv mulh INT_MIN*INT_MAX", rv_alu(mcu, cpu, rv_r(1, 0x01), 0x80000000, 0x7fffffff), 0xc0000000u);
    checkU32("rv mulhu 0xffffffff*0xffffffff", rv_alu(mcu, cpu, rv_r(3, 0x01), 0xffffffff, 0xffffffff), 0xfffffffeu);
    checkU32("rv mulhsu -1*0xffffffff", rv_alu(mcu, cpu, rv_r(2, 0x01), 0xffffffff, 0xffffffff), 0xffffffffu);
    // DIV: truncate toward zero, remainder takes the dividend's sign.
    checkU32("rv div -7/2", rv_alu(mcu, cpu, rv_r(4, 0x01), (uint32_t)-7, 2), 0xfffffffcu + 1); // -3
    checkU32("rv div INT_MIN/-1", rv_alu(mcu, cpu, rv_r(4, 0x01), 0x80000000, 0xffffffff), 0x80000000u);
    checkU32("rv div 7/-2", rv_alu(mcu, cpu, rv_r(4, 0x01), 7, 0xfffffffe), 0xfffffffcu + 1); // -3
    checkU32("rv divu 0xffffffff/0x10", rv_alu(mcu, cpu, rv_r(5, 0x01), 0xffffffff, 0x10), 0x0fffffffu);
    // RISC-V div-by-zero is NOT a trap: quotient all-ones, remainder = dividend.
    checkU32("rv div 5/0", rv_alu(mcu, cpu, rv_r(4, 0x01), 5, 0), 0xffffffffu);
    checkU32("rv divu 5/0", rv_alu(mcu, cpu, rv_r(5, 0x01), 5, 0), 0xffffffffu);
    checkU32("rv rem -7%2", rv_alu(mcu, cpu, rv_r(6, 0x01), (uint32_t)-7, 2), 0xffffffffu); // -1
    checkU32("rv rem 7%-2", rv_alu(mcu, cpu, rv_r(6, 0x01), 7, 0xfffffffe), 1);
    checkU32("rv rem INT_MIN%-1", rv_alu(mcu, cpu, rv_r(6, 0x01), 0x80000000, 0xffffffff), 0);
    checkU32("rv remu 0xffffffff%0x10", rv_alu(mcu, cpu, rv_r(7, 0x01), 0xffffffff, 0x10), 0xfu);
    checkU32("rv rem 5%0", rv_alu(mcu, cpu, rv_r(6, 0x01), 5, 0), 5);
    checkU32("rv remu 5%0", rv_alu(mcu, cpu, rv_r(7, 0x01), 5, 0), 5);
  }

  // ─── Cortex-M33 add/sub/mul/div (Thumb-16 + Thumb-32) ──────────────────
  // ADDS r5,r1,r2 / SUBS r5,r1,r2 / MULS r5,r1,r5 (rd==rm) / SDIV|UDIV r5,r1,r2 /
  // SMULL|UMULL r5,r6,r1,r2.
  {
    RP2350Options options = {.coreArch = "arm", .loadFirmware = NULL};
    RP2350* mcu = RP2350_new(&options);
    CortexM33Core* core = RP2350_armCore0_get(mcu);
    const uint16_t ADDS = 0x188d, SUBS = 0x1a8d, MULS = 0x434d; // rm=r2/r5, rn=r1, rd=r5
    const uint16_t SDIV_W1 = 0xfb91, UDIV_W1 = 0xfbb1, DIV_W2 = 0xf5f2; // r5 = r1 op r2
    const uint16_t SMULL_W1 = 0xfb81, UMULL_W1 = 0xfba1, MULL_W2 = 0x5602; // r5=lo, r6=hi
    uint32_t hi;

    checkU32("m33 adds 0x7fffffff+1", m33_exec(mcu, core, ADDS, 0, 0x7fffffff, 1, NULL), 0x80000000u);
    checkBool("m33 adds 0x7fffffff+1 N", M33Registers_N_get(core->regs), true);
    checkBool("m33 adds 0x7fffffff+1 V", M33Registers_V_get(core->regs), true);
    checkBool("m33 adds 0x7fffffff+1 C", M33Registers_C_get(core->regs), false);
    checkU32("m33 adds 0xffffffff+1", m33_exec(mcu, core, ADDS, 0, 0xffffffff, 1, NULL), 0);
    checkBool("m33 adds 0xffffffff+1 Z", M33Registers_Z_get(core->regs), true);
    checkBool("m33 adds 0xffffffff+1 C", M33Registers_C_get(core->regs), true); // carry, not signed ovf
    checkBool("m33 adds 0xffffffff+1 V", M33Registers_V_get(core->regs), false);
    checkU32("m33 subs 0-1", m33_exec(mcu, core, SUBS, 0, 0, 1, NULL), 0xffffffffu);
    checkBool("m33 subs 0-1 N", M33Registers_N_get(core->regs), true);
    checkBool("m33 subs 0-1 C", M33Registers_C_get(core->regs), false); // borrow
    checkU32("m33 subs 0x80000000-1", m33_exec(mcu, core, SUBS, 0, 0x80000000, 1, NULL), 0x7fffffffu);
    checkBool("m33 subs 0x80000000-1 V", M33Registers_V_get(core->regs), true);
    checkBool("m33 subs 0x80000000-1 C", M33Registers_C_get(core->regs), true); // no borrow unsigned

    checkU32("m33 muls 0x10001*0x10001", m33_exec(mcu, core, MULS, 0, 0x00010001, 0x00010001, NULL), 0x00020001u);
    checkU32("m33 muls -1*-1", m33_exec(mcu, core, MULS, 0, 0xffffffff, 0xffffffff, NULL), 1);
    checkU32("m33 smull INT_MIN*INT_MIN lo", m33_exec(mcu, core, SMULL_W1, MULL_W2, 0x80000000, 0x80000000, &hi), 0);
    checkU32("m33 smull INT_MIN*INT_MIN hi", hi, 0x40000000u);
    checkU32("m33 smull -1*1 lo", m33_exec(mcu, core, SMULL_W1, MULL_W2, 0xffffffff, 1, &hi), 0xffffffffu);
    checkU32("m33 smull -1*1 hi", hi, 0xffffffffu);
    checkU32("m33 umull 0xffffffff*0xffffffff lo", m33_exec(mcu, core, UMULL_W1, MULL_W2, 0xffffffff, 0xffffffff, &hi), 1);
    checkU32("m33 umull 0xffffffff*0xffffffff hi", hi, 0xfffffffeu);

    checkU32("m33 sdiv -7/2", m33_exec(mcu, core, SDIV_W1, DIV_W2, (uint32_t)-7, 2, NULL), (uint32_t)-3);
    checkU32("m33 sdiv INT_MIN/-1", m33_exec(mcu, core, SDIV_W1, DIV_W2, 0x80000000, 0xffffffff, NULL), 0x80000000u);
    checkU32("m33 sdiv 5/0", m33_exec(mcu, core, SDIV_W1, DIV_W2, 5, 0, NULL), 0); // untrapped: 0
    checkU32("m33 udiv 0xffffffff/0x10", m33_exec(mcu, core, UDIV_W1, DIV_W2, 0xffffffff, 0x10, NULL), 0x0fffffffu);
    checkU32("m33 udiv 5/0", m33_exec(mcu, core, UDIV_W1, DIV_W2, 5, 0, NULL), 0); // untrapped: 0
  }

  // ─── Cortex-M0+ add/sub/mul (Thumb-16; no div on this core) ────────────
  {
    RP2040Options options = {.loadFirmware = NULL};
    RP2040* mcu = RP2040_new(&options);
    CortexM0Core* core = RP2040_core0_get(mcu);
    const uint16_t ADDS = 0x188d, SUBS = 0x1a8d, MULS = 0x434d; // rm=r2/r5, rn=r1, rd=r5

    checkU32("m0 adds 0x7fffffff+1", m0_exec(mcu, core, ADDS, 0x7fffffff, 1), 0x80000000u);
    checkBool("m0 adds 0x7fffffff+1 N", core->N, true);
    checkBool("m0 adds 0x7fffffff+1 C", core->C, false);
    checkU32("m0 adds 0xffffffff+1", m0_exec(mcu, core, ADDS, 0xffffffff, 1), 0);
    checkBool("m0 adds 0xffffffff+1 Z", core->Z, true);
    checkBool("m0 adds 0xffffffff+1 C", core->C, true);
    checkU32("m0 subs 0-1", m0_exec(mcu, core, SUBS, 0, 1), 0xffffffffu);
    checkBool("m0 subs 0-1 N", core->N, true);
    checkBool("m0 subs 0-1 C", core->C, false); // borrow
    checkU32("m0 subs 0x80000000-1", m0_exec(mcu, core, SUBS, 0x80000000, 1), 0x7fffffffu);
    checkBool("m0 subs 0x80000000-1 C", core->C, true);
    checkU32("m0 muls 0x10001*0x10001", m0_exec(mcu, core, MULS, 0x00010001, 0x00010001), 0x00020001u);
    checkU32("m0 muls -1*-1", m0_exec(mcu, core, MULS, 0xffffffff, 0xffffffff), 1);
  }

  // ─── USB CDC enumeration + data (both chip flavors) ────────────────────
  check_usb_cdc_rp2350();
  check_usb_cdc_rp2040();

  // ─── Timer alarm scheduling past INT32_MAX ns ──────────────────────────
  check_timer_alarm_overflow();

  if (failures > 0) {
    fprintf(stderr, "\n%d check(s) FAILED\n", failures);
    return 1;
  }
  printf("\nAll helper checks passed.\n");
  return 0;
}
